
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	ОбновитьКартуМаршрута(ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКартуМаршрута(ГосУслуга)
	
	КартаМаршрута = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГосУслуга", ГосУслуга);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ГосУслуги.КартаМаршрута КАК КартаМаршрута
	|ИЗ
	|	Справочник.ГосУслуги КАК ГосУслуги
	|ГДЕ
	|	ГосУслуги.Ссылка = &ГосУслуга";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		КартаМаршрута = Выборка.КартаМаршрута.Получить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ЗаписьГосУслуги" Тогда
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		Если ТекущиеДанные.Ссылка = Параметр Тогда
			ОбновитьКартуМаршрута(ТекущиеДанные.Ссылка);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
