
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		
		// Показываем карту бизнес-процесса
		
		ОбновитьКартуМаршрута();
		
	КонецЕсли;
	
	ПоказатьСкрытьРазмерПошлины();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКартуМаршрута()
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	КартаМаршрута = ОбъектНаСервере.КартаМаршрута.Получить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПлатнаяУслугаПриИзменении(Элемент)
	
	ПоказатьСкрытьРазмерПошлины();
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьСкрытьРазмерПошлины()
	
	Элементы.РазмерПошлины.Видимость = Объект.ПлатнаяУслуга;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Сохраняем карту бизнес-процесса
	ТекущийОбъект.КартаМаршрута = Новый ХранилищеЗначения(КартаМаршрута, Новый СжатиеДанных(9));
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьКартуМаршрута();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ЗаписьГосУслуги", Объект.Ссылка);
	
КонецПроцедуры
