
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявлениеНаПредоставлениеГосуслуги") Тогда
		ЗаявлениеНаПредоставлениеГосуслуги = ДанныеЗаполнения;
		ГосУслуга = ДанныеЗаполнения.ГосУслуга;
		КаналПоступленияЗаявления = ДанныеЗаполнения.КаналПоступленияЗаявления;
		Получатель = ДанныеЗаполнения.Получатель;
		ДатаЗаявления = Документы.ЗаявлениеНаПредоставлениеГосуслуги.ЗначениеПоляЗаявления(
			ДанныеЗаполнения, ПланыВидовХарактеристик.ВидПоляЗаявления.ДатаЗаявления);
	КонецЕсли;
	
	// Устанавливаем карту маршрута
	КартаМаршрута = Новый ХранилищеЗначения(ГосУслуга.КартаМаршрута.Получить());
	
	// Вычисляем ожидаемый срок выполнения
	ЧислоСекундВСутках = 86400;
	ОжидаемыйСрокВыполнения = ДатаЗаявления + ЧислоСекундВСутках * ГосУслуга.СрокВыполнения;
	
	Дата = ТекущаяДата();
	Автор = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры
