
Функция НайтиСоздатьПользователя(ПользовательИБ) Экспорт
	
	Если Не ТипЗнч(ПользовательИБ) = Тип("ПользовательИнформационнойБазы") Тогда
		Возврат Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторПользователяИБ", ПользовательИБ.УникальныйИдентификатор);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.ИдентификаторПользователяИБ = &ИдентификаторПользователяИБ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		ПользовательОбъект = Справочники.Пользователи.СоздатьЭлемент();
		Если ЗначениеЗаполнено(ПользовательИБ.Имя) Тогда
			ИмяПользователя = ПользовательИБ.Имя;
		Иначе
			ИмяПользователя = "<Не указан>";
		КонецЕсли;
		ПользовательОбъект.Наименование					= ИмяПользователя;
		ПользовательОбъект.ПолноеИмя					= ПользовательИБ.ПолноеИмя;
		ПользовательОбъект.ИдентификаторПользователяИБ	= ПользовательИБ.УникальныйИдентификатор;
		ПользовательОбъект.Записать();
		Возврат ПользовательОбъект.Ссылка;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции
